# tap "bfontaine/utils"
# tap "browsh-org/browsh"
# tap "egoist/tap"
# tap "ejoffe/tap"
# tap "eth-p/software"
tap "federico-terzi/espanso"
tap "github/gh"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/cask-fonts"
# tap "homebrew/cask-versions"
# tap "homebrew/core"
# tap "homebrew/services"
# tap "thash/asana"
# brew "ansible"
# brew "ansible-lint"
# brew "webp"
# brew "awscli"
brew "bash-completion"
# brew "bat"
# brew "glib"
# brew "python@3.9"
# brew "cmake"
brew "direnv"
# brew "erlang"
# brew "elixir"
# brew "exercism"
# brew "fastlane"
brew "fd"
# brew "harfbuzz"
# brew "gobject-introspection"
# brew "ffmpeg"
# brew "flyctl"
# brew "fpp"
brew "fzf"
brew "gh"
brew "git"
brew "git-bug"
# brew "git-crypt"
# brew "git-delta"
brew "git-flow"
brew "gnupg"
# brew "hadolint"
# brew "haskell-stack"
# brew "homeshick"
# brew "hub"
# brew "jo"
brew "jq"
# brew "lesspipe"
brew "mas"
brew "ncdu"
brew "node"
brew "node@10"
brew "node@12"
brew "node@14"
brew "node@16"
# brew "numpy"
# brew "pandoc"
# brew "parallel"
# brew "prettier"
# brew "qrcp"
# brew "rbenv"
# brew "ripgrep"
# brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "starship"
# brew "step"
# brew "subversion"
brew "tig"
brew "tldr"
brew "todo-txt"
# brew "typescript"
brew "universal-ctags"
brew "vim"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "z"
# brew "ejoffe/tap/spr"
brew "federico-terzi/espanso/espanso"
# cask "android-platform-tools"
cask "anki"
cask "chromium"
cask "clipy"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-input"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
# cask "keepingyouawake"
cask "michaelvillar-timer"
cask "mongodb-compass"
# cask "monodraw"
cask "obsidian"
cask "opera"
# cask "postman"
# cask "react-native-debugger"
cask "rectangle"
# cask "robo-3t"
cask "skype"
# cask "studio-3t"
cask "syncthing"
cask "telegram"
cask "toggl"
cask "tor-browser"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "zoom"
# mas "Keynote", id: 409183694
mas "LINE", id: 539883307
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
mas "Thor Launcher", id: 1120999687
# mas "Xcode", id: 497799835
# whalebrew "whalebrew/imagemagick"
# whalebrew "whalebrew/mitmproxy"
