tap "aws/tap"
tap "bufbuild/buf"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jonz94/sarasa-nerd-fonts"
tap "vldmrkl/formulae"
brew "abseil"
brew "alerter"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "gmp"
brew "asdf"
brew "assimp"
brew "python@3.11"
brew "awscli"
brew "oniguruma"
brew "bat"
brew "berkeley-db"
brew "python@3.12"
brew "black"
brew "c-ares"
brew "freetype"
brew "fontconfig"
brew "glib"
brew "certifi"
brew "cmake"
brew "cocoapods"
brew "direnv"
brew "docker", link: false
brew "docutils"
brew "doggo"
brew "duckdb"
brew "libevent"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "elixir"
brew "exercism"
brew "fastlane"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "fish"
brew "flyctl"
brew "fpp"
brew "node"
brew "fx"
brew "fzf"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-getopt"
brew "git-flow-avh"
brew "glab"
brew "gnu-tar"
brew "libgcrypt"
brew "libksba"
brew "openldap"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "go"
brew "netpbm"
brew "gts"
brew "gum"
brew "helix"
brew "htmlq"
brew "john"
brew "jq"
brew "jrnl"
brew "librsvg"
brew "libvterm"
brew "libzip"
brew "lima"
brew "lsd"
brew "luajit"
brew "lynx"
brew "mas"
brew "ncdu"
brew "neovim"
brew "openssl@1.1"
brew "python@3.10"
brew "node@14"
brew "node@16"
brew "node@18"
brew "nss"
brew "openjdk"
brew "openjdk@11"
brew "perl"
brew "pipx"
brew "poetry"
brew "protobuf"
brew "protobuf@21"
brew "protobuf@3"
brew "protoc-gen-grpc-web"
brew "protolint"
brew "pyyaml"
brew "python-yq", link: false
brew "ripgrep"
brew "ruby@2.7"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "slides"
brew "starship"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "todo-txt"
brew "toot"
brew "ttyplot"
brew "universal-ctags"
brew "vim"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "xh"
brew "youtube-dl"
brew "yq"
brew "zoxide"
brew "aws/tap/lightsailctl"
brew "bufbuild/buf/buf"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp", "with-spacemacs-icon"]
brew "jesseduffield/lazygit/lazygit"
brew "vldmrkl/formulae/airdrop-cli"
cask "adoptopenjdk8"
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "anytype"
cask "beyond-compare"
cask "clipy"
cask "docker"
cask "eloston-chromium"
cask "espanso"
cask "firefox"
cask "firefox@developer-edition"
cask "firefox@nightly"
cask "floorp"
cask "font-inconsolata-lgc-nerd-font"
cask "font-sarasa-mono-tc-nerd-font"
cask "font-source-code-pro"
cask "google-cloud-sdk"
cask "inso"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "keepingyouawake"
cask "keybase"
cask "librewolf"
cask "livebook"
cask "michaelvillar-timer"
cask "monodraw"
cask "obsidian"
cask "opera"
cask "origin"
cask "orion"
cask "qutebrowser"
cask "react-native-debugger"
cask "rectangle"
cask "signal"
cask "skype"
cask "sqlworkbenchj"
cask "standard-notes"
cask "syncthing"
cask "telegram"
cask "thor"
cask "tor-browser"
cask "utm"
cask "vagrant"
cask "vlc"
cask "warp"
cask "zed"
cask "zoom"
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "QR Journal", id: 483820530
mas "TestFlight", id: 899247664
mas "Toggl Track", id: 1291898086
mas "Xcode", id: 497799835
