tap "bfontaine/utils"
tap "browsh-org/browsh"
tap "egoist/tap"
tap "ejoffe/tap"
tap "eth-p/software"
tap "federico-terzi/espanso"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thash/asana"
brew "aichat"
brew "sqlite"
brew "ansible"
brew "yamllint"
brew "ansible-lint"
brew "webp"
brew "apr-util"
brew "openssl@3", link: false
brew "asdf"
brew "augeas"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "glib"
brew "python@3.9"
brew "tcl-tk"
brew "cmake"
brew "direnv"
brew "folly"
brew "edencommon"
brew "wxwidgets"
brew "erlang"
brew "elixir"
brew "exercism"
brew "fastlane"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "ffmpeg"
brew "flyctl"
brew "fpp"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-bug"
brew "git-crypt"
brew "git-delta"
brew "git-flow"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "guile"
brew "hadolint"
brew "haskell-stack"
brew "homeshick"
brew "hub"
brew "jo"
brew "jq"
brew "jsonschema"
brew "lesspipe"
brew "libde265"
brew "libomp", link: true
brew "lsd"
brew "lynx"
brew "mas"
brew "ncdu"
brew "nghttp2"
brew "node"
brew "python@3.10"
brew "node@14"
brew "node@16"
brew "numpy"
brew "pandoc"
brew "parallel"
brew "perl"
brew "prettier"
brew "python@3.8"
brew "qrcp"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "ruby@2.7"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "step"
brew "subversion"
brew "tig"
brew "tldr"
brew "todo-txt"
brew "toot"
brew "typescript"
brew "universal-ctags"
brew "vim"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "zoxide"
brew "ejoffe/tap/spr"
cask "android-platform-tools"
cask "anki"
cask "arc"
cask "chromium"
cask "clipy"
cask "docker"
cask "espanso"
cask "firefox"
cask "firefox-developer-edition"
cask "font-inconsolata-lgc-nerd-font"
cask "font-input"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "keepingyouawake"
cask "librewolf"
cask "michaelvillar-timer"
cask "mongodb-compass"
cask "monodraw"
cask "mullvad-browser"
cask "obsidian"
cask "opera"
cask "postman"
cask "praat"
cask "qutebrowser"
cask "react-native-debugger"
cask "rectangle"
cask "robo-3t"
cask "skype"
cask "studio-3t"
cask "syncthing"
cask "telegram"
cask "tor-browser"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "zoom"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Thor Launcher", id: 1120999687
mas "Xcode", id: 497799835
whalebrew "whalebrew/imagemagick"
whalebrew "whalebrew/mitmproxy"
