#!/usr/bin/env sh

[ -n "$SET_X" ] && set -x

dailies() {
  cat <<'EOF'
        Ⅷ  Ⅷ  Ⅳ  Ⅱ  Ⅳ  Ⅰ  Ⅲ  Ⅳ  Ⅰ  Ⅱ  Ⅱ  Ⅰ  Ⅰ  Ⅰ
07:00 300 🥛 💡 😻 😿 🧆 🍛 💊 🐤 🚽 👓 🌻 📷   
08:40 300 🥛                                    
10:20 300 🥛                                    
12:00 300 🥛       😿    🍛 💊                  
13:40 300 🥛                                    
15:20 300 🥛                                    
17:00 300 🥛 💡    😿                           
18:00 180 🥛             🍛 💊 🥣               
19:00 180 🥛 💡 😻    🚰       🍽️               
20:00 180 🥛                                    
22:00        💡    😿       💊    🚽 👓 ⌚️ 👁️ 💅

📤 洗澡 美甲 洗臉 修眉 隱眼 保養 敷臉 趕貓 香水 梳頭 穿搭 喝水 護唇 項鍊 編髮 耳環 手環 錶面 精華 護手 手機 電源 妝包 腳架 特典

💄 防曬 面紙 棉棒 眉筆 飾底 底液 遮瑕 蜜粉 腮紅 唇彩 戒指 口罩 髮夾

📥 餵藥 換水 飾品 鞋墊 貓砂 隱眼 卸妝 洗臉 保養

🍳 ➕ 📚 ➕ ♻️     📺 ➕ 🧶 ➕ 🪥    🥕 ➕ 🚪 ➕ 🪭     💰 ➕ 🛍️ ➕ ‼️     🗣️ ➕ 🐌 ➕ ‼️

🎻 ➕ 🎞️ ➕ 📚
EOF

}

dailies "$@"
