#!/usr/bin/env sh

[ -n "$SET_X" ] && set -x

id() {
  cat <<'EOF'
姓名：陳筱玲
出生年月日：民國 57 年 6 月 5 日
發證日期：民國 94 年 7月 1日(北市)換發
性別：女
統一編號：A234567890

父：陳德明
母：吳春美
配偶：金大昇
役別：
出生地：臺北市
住址：114043臺北市內湖區萬州里1鄰民權東路六段283巷165弄218號

   A B C D E F G H I J K L M N O P Q R S T U V W X Y Z
 1 1 0 9 8 7 6 5 4 9 3 2 2 1 0 8 9 8 7 6 5 4 3 1 3 2 0

   0 1 2 3 4 5 6 7 8 9
 2 0 8 6 4 2 0 8 6 4 2
 3 0 7 4 1 8 5 2 9 6 3
 4 0 6 2 8 4 0 6 2 8 4
 5 0 5 0 5 0 5 0 5 0 5
 6 0 4 8 2 6 0 4 8 2 6
 7 0 3 6 9 2 5 8 1 4 7
 8 0 2 4 6 8 0 2 4 6 8
 9 0 1 2 3 4 5 6 7 8 9
10 0 1 2 3 4 5 6 7 8 9
EOF
}

id "$@"
